a = 5 # integer int() целое число
name = 'Никита' # string str() строка (текст)
p = 3.14 # float() с плавающей точкой
b = True # True/False boolean (логический тип даных)

# СПИСКИ
#  ключи   0        1        2        3       4      
# names = ['Иван', 'Андрей', 'Алла', 'София', 'Илья']
#                            -3      -2       -1

# print(names[4])
# print(names)

# for name in names:
#     print(name)

# СЛОВАРИ
#  ключи  ключ   значение    ключ     значение  ключ     значение   ключ     значение
names = {'Иван': 'Иванов', 'Андрей': 'Андреев', 'Алла': 'Петрова', 'София' : 'Гнатенко', 'Илья': 'Муромец'}

# print(names['Андрей'])
# for name, surname in names.items():
#     print(name, surname)

# ПРАКТИКА

prices = {'молоко' :65, 'хлеб' :40, 'конфеты' :350, 'огурцы' :90, 'сметана' :70}
shopping_list = {'молоко' :1, 'хлеб' :2, 'конфеты' :2, 'огурцы' :5, 'сметана': 6}